In [336]:
import pandas as pd
import numpy as np

# Series

In [337]:
dictionary = {'bmw': 'i5','audi': 'a6','volvo': 's90' }

In [338]:
cars = pd.Series(dictionary)
pd.Series(dictionary)

bmw       i5
audi      a6
volvo    s90
dtype: object

In [339]:
numpyArray = np.array((50,40,30))

In [340]:
pd.Series(numpyArray)

0    50
1    40
2    30
dtype: int32

In [341]:
myNumbers = [10,20,30,40]
myİndex = ['İndex1','İndex2','İndex3','İndex4']

In [342]:
pd.Series(data = myNumbers,index = myİndex)

İndex1    10
İndex2    20
İndex3    30
İndex4    40
dtype: int64

In [343]:
cars['bmw']

'i5'

In [344]:
carsMaxSpeed = {'bmw': 280,'audi': 260,'volvo': 220}
carsMaxSpeed = pd.Series(carsMaxSpeed)

In [345]:
carsMaxSpeed = carsMaxSpeed + carsMaxSpeed
carsMaxSpeed

bmw      560
audi     520
volvo    440
dtype: int64

# Dataframe

In [346]:
## Serilerin bir araya gelmesi ile olusur

In [347]:
data = np.random.randn(4,3)
data

array([[-1.41447606, -1.01373205,  0.51079061],
       [ 0.95029007,  2.39690151, -0.01329251],
       [-0.64348672,  0.40087354,  1.88734818],
       [ 0.21157294, -0.24044642, -0.71998925]])

In [348]:
df = pd.DataFrame(data)
df

          0         1         2
0 -1.414476 -1.013732  0.510791
1  0.950290  2.396902 -0.013293
2 -0.643487  0.400874  1.887348
3  0.211573 -0.240446 -0.719989

In [349]:
df[0]

0   -1.414476
1    0.950290
2   -0.643487
3    0.211573
Name: 0, dtype: float64

In [350]:
df[0][0]

-1.4144760585121077

In [351]:
newDataFrame = pd.DataFrame(data,index=['İndex1','İndex2','İndex3','İndex4'],columns=['Column1','Column2','Column3'])
newDataFrame

         Column1   Column2   Column3
İndex1 -1.414476 -1.013732  0.510791
İndex2  0.950290  2.396902 -0.013293
İndex3 -0.643487  0.400874  1.887348
İndex4  0.211573 -0.240446 -0.719989

In [352]:
newDataFrame['Column1']

İndex1   -1.414476
İndex2    0.950290
İndex3   -0.643487
İndex4    0.211573
Name: Column1, dtype: float64

In [353]:
newDataFrame['Column2']['İndex3']

0.4008735445440364

In [354]:
newDataFrame.iloc[1]#İndex Location

Column1    0.950290
Column2    2.396902
Column3   -0.013293
Name: İndex2, dtype: float64

In [355]:
newDataFrame['Column4'] = newDataFrame['Column2'] + newDataFrame['Column3']
newDataFrame

         Column1   Column2   Column3   Column4
İndex1 -1.414476 -1.013732  0.510791 -0.502941
İndex2  0.950290  2.396902 -0.013293  2.383609
İndex3 -0.643487  0.400874  1.887348  2.288222
İndex4  0.211573 -0.240446 -0.719989 -0.960436

In [356]:
newDataFrame =newDataFrame.drop('Column4',axis=1)
newDataFrame

         Column1   Column2   Column3
İndex1 -1.414476 -1.013732  0.510791
İndex2  0.950290  2.396902 -0.013293
İndex3 -0.643487  0.400874  1.887348
İndex4  0.211573 -0.240446 -0.719989

In [357]:
newDataFrame.drop('İndex2',axis=0)##Drop metodunda kolon silerken axis belirtmeliyiz.
##İndex silerken default 0 oldugu icin belirtmek zorunda degiliz

         Column1   Column2   Column3
İndex1 -1.414476 -1.013732  0.510791
İndex3 -0.643487  0.400874  1.887348
İndex4  0.211573 -0.240446 -0.719989

In [358]:
newDataFrame

         Column1   Column2   Column3
İndex1 -1.414476 -1.013732  0.510791
İndex2  0.950290  2.396902 -0.013293
İndex3 -0.643487  0.400874  1.887348
İndex4  0.211573 -0.240446 -0.719989

In [359]:
newDataFrame.drop('İndex2',axis=0,inplace=True)
newDataFrame## İnplace True olursa atama yapmadan kalıcı olarak silebiliyoruz istenen data'yı

         Column1   Column2   Column3
İndex1 -1.414476 -1.013732  0.510791
İndex3 -0.643487  0.400874  1.887348
İndex4  0.211573 -0.240446 -0.719989

In [360]:
newDataFrame[newDataFrame < 0]

         Column1   Column2   Column3
İndex1 -1.414476 -1.013732       NaN
İndex3 -0.643487       NaN       NaN
İndex4       NaN -0.240446 -0.719989

In [361]:
newDataFrame <0

        Column1  Column2  Column3
İndex1     True     True    False
İndex3     True    False    False
İndex4    False     True     True

In [362]:
newDataFrame['Column1']>0

İndex1    False
İndex3    False
İndex4     True
Name: Column1, dtype: bool

In [363]:
newDataFrame[newDataFrame['Column1']>0]

         Column1   Column2   Column3
İndex4  0.211573 -0.240446 -0.719989

In [364]:
newDataFrame[newDataFrame['Column1']<0]

         Column1   Column2   Column3
İndex1 -1.414476 -1.013732  0.510791
İndex3 -0.643487  0.400874  1.887348

In [365]:
##İndex Change - Reindex

In [366]:
newDataFrame = pd.DataFrame(data,index=['İndex1','İndex2','İndex3','İndex4'],columns=['Column1','Column2','Column3'])
newDataFrame

         Column1   Column2   Column3
İndex1 -1.414476 -1.013732  0.510791
İndex2  0.950290  2.396902 -0.013293
İndex3 -0.643487  0.400874  1.887348
İndex4  0.211573 -0.240446 -0.719989

In [367]:
newDataFrame.reset_index()

    index   Column1   Column2   Column3
0  İndex1 -1.414476 -1.013732  0.510791
1  İndex2  0.950290  2.396902 -0.013293
2  İndex3 -0.643487  0.400874  1.887348
3  İndex4  0.211573 -0.240446 -0.719989

In [368]:
newİndexList = ['Number1','Number2','Number3','Number4']
newDataFrame['New İndex'] = newİndexList

In [369]:
newDataFrame.set_index('New İndex',inplace=True)

In [370]:
newDataFrame

            Column1   Column2   Column3
New İndex
Number1   -1.414476 -1.013732  0.510791
Number2    0.950290  2.396902 -0.013293
Number3   -0.643487  0.400874  1.887348
Number4    0.211573 -0.240446 -0.719989

## Multi İndex

In [371]:
firstİndexs = ['Bmw','Bmw','Bmw','Audi','Audi','Audi']
secondİndex = ['M5','M4','M3','A6','A5','A4']
zipList = list(zip(firstİndexs,secondİndex))
zipList

[('Bmw', 'M5'),
 ('Bmw', 'M4'),
 ('Bmw', 'M3'),
 ('Audi', 'A6'),
 ('Audi', 'A5'),
 ('Audi', 'A4')]

In [372]:
jointİndexs = pd.MultiIndex.from_tuples(zipList)
jointİndexs

MultiIndex([( 'Bmw', 'M5'),
            ( 'Bmw', 'M4'),
            ( 'Bmw', 'M3'),
            ('Audi', 'A6'),
            ('Audi', 'A5'),
            ('Audi', 'A4')],
           )

In [373]:
type(jointİndexs)

pandas.core.indexes.multi.MultiIndex

In [374]:
myCarList = [[300,'50000$'],[280,'40000$'],[260,'30000$'],[250,'50000$'],[260,'40000$'],[270,'30000$']]
myCarList

[[300, '50000$'],
 [280, '40000$'],
 [260, '30000$'],
 [250, '50000$'],
 [260, '40000$'],
 [270, '30000$']]

In [375]:
carDataFrame = pd.DataFrame(myCarList,index=jointİndexs,columns=['Speed','Price'])

In [376]:
carDataFrame

         Speed   Price
Bmw  M5    300  50000$
     M4    280  40000$
     M3    260  30000$
Audi A6    250  50000$
     A5    260  40000$
     A4    270  30000$

In [377]:
carDataFrame.loc['Bmw']

    Speed   Price
M5    300  50000$
M4    280  40000$
M3    260  30000$

In [378]:
carDataFrame.loc['Audi'].loc['A6']

Speed       250
Price    50000$
Name: A6, dtype: object

In [379]:
carDataFrame.index.names = ['Mark','Model']
carDataFrame

            Speed   Price
Mark Model
Bmw  M5       300  50000$
     M4       280  40000$
     M3       260  30000$
Audi A6       250  50000$
     A5       260  40000$
     A4       270  30000$